Revit 2026 API

# ConnectorElementDomain Property

---

The domain of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual Domain Domain { get; }
```
```vb
Public Overridable ReadOnly Property Domain As Domain
	Get
```
```cpp
public:
virtual property Domain Domain {
	Domain get ();
}
```
```fsharp
abstract Domain : Domain with get
override Domain : Domain with get
```

#### Property Value

Domain

#### Implements

IConnectorDomain

This property is used to retrieve the domain of the connector.

#### Reference

ConnectorElement Class

Autodesk.Revit.DB Namespace